html/erlang/tutorial/sequential/atom.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>原子类型</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="../css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="module_function.html"> UP </a>
 |
 <a accesskey="H" href="sequential.html"> HOME </a>
</div><div id="content">
<h1 class="title">原子类型</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5f73756">原子</a></li>
<li><a href="#orge1c86d2">元组</a></li>
</ul>
</div>
</div>


<div id="outline-container-org5f73756" class="outline-2">
<h2 id="org5f73756">原子</h2>
<div class="outline-text-2" id="text-org5f73756">
<p>
原子类型是 Erlang 语言中另一种数据类型。所有原子类型都以 <span class="underline">小写字母</span> 开头。原子类型就是名字而已，没有其它含义。它们与变量不同，变量拥有值，而原子类型没有
</p>

<pre class="example">
例如，charles，centimeter，inch 等
</pre>

<p>
下面程序完成英寸与厘米之间的相互转换：
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #ffd700;">-module</span>(atom).
<span style="color: #ffd700;">-export</span>([<span style="color: #98f5ff;">convert/2</span>]).

<span style="color: #daa520; font-weight: bold;">convert</span>(<span style="color: #4eee94;">M</span>, inch) -&gt;
    <span style="color: #4eee94;">M</span> / 2.54;

<span style="color: #daa520; font-weight: bold;">convert</span>(<span style="color: #4eee94;">N</span>, centimeter) -&gt;
    <span style="color: #4eee94;">N</span> * 2.54.
</pre>
</div>


<p>
测试：
</p>
<div class="org-src-container">
<pre class="src src-sh">2&gt; atom:convert(10,inch)<span style="color: #f08080;">.</span>
atom:convert(10,inch)<span style="color: #f08080;">.</span>
3.937007874015748
3&gt; atom:convert(10,centimeter)<span style="color: #f08080;">.</span>
atom:convert(10,centimeter)<span style="color: #f08080;">.</span>
25.4
</pre>
</div>

<pre class="example">
到目前为止都没有介绍小数（符点数）的相关内容
</pre>

<p>
如果输入的参数既不是 centimeter 也不是 inch 时会发生什么情况：
</p>

<div class="org-src-container">
<pre class="src src-sh">4&gt; atom:convert(10,mile)<span style="color: #f08080;">.</span>
atom:convert(10,mile)<span style="color: #f08080;">.</span>
** exception error: no <span style="color: #00bfff; font-weight: bold;">function</span> <span style="color: #daa520; font-weight: bold;">clause</span> matching 
                    atom:convert(10,mile) (atom.erl, line 4)
</pre>
</div>

<p>
convert 函数的两部分被称之为函数的两个子句
</p>

<pre class="example">
正如所看到的那样，miles 并不是子句的一部分。Erlang 系统找不到匹配的子句，所以返回了错误消息 function_clause
</pre>

<p>
shell 负责被错误信息友好地输出，同时错误元组会被存储到 shell 的历史列表中，可以使用 <span class="underline">v/1</span> 命令将该列表输出：
</p>

<div class="org-src-container">
<pre class="src src-sh">5&gt; v(4)<span style="color: #f08080;">.</span> 
<span style="color: #daa520; font-weight: bold;">v</span>(4)<span style="color: #f08080;">.</span> 
{<span style="color: #deb887;">'EXIT'</span>,{function_clause,[{atom,convert,
                                [10,mile],
                                [{file,<span style="color: #deb887;">"atom.erl"</span>},{line,4}]},
                          {erl_eval,do_apply,6,[{file,<span style="color: #deb887;">"erl_eval.erl"</span>},{line,684}]},
                          {shell,exprs,7,[{file,<span style="color: #deb887;">"shell.erl"</span>},{line,686}]},
                          {shell,eval_exprs,7,[{file,<span style="color: #deb887;">"shell.erl"</span>},{line,642}]},
                          {shell,eval_loop,3,[{file,<span style="color: #deb887;">"shell.erl"</span>},{line,627}]}]}}
</pre>
</div>
</div>
</div>

<div id="outline-container-orge1c86d2" class="outline-2">
<h2 id="orge1c86d2">元组</h2>
<div class="outline-text-2" id="text-orge1c86d2">
<p>
前面程序的风格不是一好的编程风格。例如：
</p>
<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #98f5ff;">atom</span>:<span style="color: #98f5ff;">convert</span>(3,inch)  
</pre>
</div>
<pre class="example">
这是意味着 3 本身已经是英寸表示了呢？还是指将 3 厘米转换成英寸呢？ 
</pre>

<p>
Erlang 提供了将 <b>某些元素分成组</b> 并用以更易于理解的方式表示的机制。它就是 <span class="underline">元组</span> 。一个元组由 <span class="underline">花括号</span> 括起来的：
</p>

<pre class="example">
{inch,3} 指的就是 3 英寸，而 {centimeter, 5} 指的就是 5 厘米
</pre>

<p>
接下来，重写厘米与英寸之间的转换程序：
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #ffd700;">-module</span>(atom).
<span style="color: #ffd700;">-export</span>([<span style="color: #98f5ff;">convert_length/1</span>]).

<span style="color: #daa520; font-weight: bold;">convert_length</span>({centimeter, <span style="color: #4eee94;">X</span>}) -&gt;
    {inch, <span style="color: #4eee94;">X</span> / 2.54};
<span style="color: #daa520; font-weight: bold;">convert_length</span>({inch, <span style="color: #4eee94;">Y</span>}) -&gt;
    {centimeter, <span style="color: #4eee94;">Y</span> * 2.54}.
</pre>
</div>

<p>
编译并测试：
</p>

<div class="org-src-container">
<pre class="src src-sh">9&gt; atom:convert_length({inch, 5})<span style="color: #f08080;">.</span> 
atom:convert_length({inch, 5})<span style="color: #f08080;">.</span> 
{centimeter,12.7}

10&gt; atom:convert_length(atom:convert_length({inch, 5}))<span style="color: #f08080;">.</span> 
atom:convert_length(atom:convert_length({inch, 5}))<span style="color: #f08080;">.</span> 
{inch,5.0}
</pre>
</div>

<pre class="example">
请注意：第二个测试代码将 5 英寸转换成厘米后，再转换为就英寸，所以它得到原来的值。这也表明，一个函数实参可以是另一个函数的返回结果
</pre>


<p>
元组中可以有更多的元素，而不仅仅像上面描述的那样只有两部分。事实上，可以在元组中，使用任意多的部分，只要每个部分都是合法的 Erlang 的项。例如，表示世界上不同城市的温度值：
</p>

<div class="org-src-container">
<pre class="src src-erlang">{moscow, {c, -10}}

{cape_town, {f, 70}}

{paris, {f, 28}}
</pre>
</div>

<p>
这些元组中每个都有固定数目的项。元组中的 <b>每个项</b> 都被称之为一个 <span class="underline">元素</span> 
</p>
<pre class="example">
在元组 {moscow,{c,-10}} 中，第一个元素为 moscow 而第二个元素为 {c,-10}。其中，c 表示摄氏度，f 表示华氏度
</pre>

<p>
<a href="list.html">Next：列表</a>
</p>

<p>
<a href="module_function.html">Previous：模块和函数</a>
</p>

<p>
<a href="sequential.html">Home：顺序编程</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
